{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "BatchNormalization", "config": {"batch_input_shape": [null, 160, 320, 3], "input_dtype": "float32", "axis": -1, "mode": 0, "momentum": 0.99, "gamma_regularizer": null, "epsilon": 0.001, "name": "batchnormalization_1", "trainable": true, "beta_regularizer": null}}, {"class_name": "Convolution2D", "config": {"activation": "relu", "activity_regularizer": null, "nb_col": 5, "border_mode": "valid", "subsample": [2, 2], "nb_row": 5, "b_constraint": null, "bias": true, "trainable": true, "nb_filter": 24, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "name": "convolution2d_1", "init": "glorot_uniform", "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"activation": "relu", "activity_regularizer": null, "nb_col": 5, "border_mode": "valid", "subsample": [2, 2], "nb_row": 5, "b_constraint": null, "bias": true, "trainable": true, "nb_filter": 36, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "name": "convolution2d_2", "init": "glorot_uniform", "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.5}}, {"class_name": "Convolution2D", "config": {"activation": "relu", "activity_regularizer": null, "nb_col": 5, "border_mode": "valid", "subsample": [2, 2], "nb_row": 5, "b_constraint": null, "bias": true, "trainable": true, "nb_filter": 48, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "name": "convolution2d_3", "init": "glorot_uniform", "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.5}}, {"class_name": "Convolution2D", "config": {"activation": "relu", "activity_regularizer": null, "nb_col": 3, "border_mode": "valid", "subsample": [1, 1], "nb_row": 3, "b_constraint": null, "bias": true, "trainable": true, "batch_input_shape": [null, 160, 320, 3], "input_dtype": "float32", "nb_filter": 64, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "name": "convolution2d_4", "init": "glorot_uniform", "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "p": 0.5}}, {"class_name": "Convolution2D", "config": {"activation": "relu", "activity_regularizer": null, "nb_col": 3, "border_mode": "valid", "subsample": [1, 1], "nb_row": 3, "b_constraint": null, "bias": true, "trainable": true, "batch_input_shape": [null, 160, 320, 3], "input_dtype": "float32", "nb_filter": 64, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "name": "convolution2d_5", "init": "glorot_uniform", "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "p": 0.5}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"output_dim": 100, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "activation": "linear", "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "bias": true, "init": "glorot_uniform", "input_dim": 27456}}, {"class_name": "Dense", "config": {"output_dim": 50, "b_constraint": null, "name": "dense_2", "activity_regularizer": null, "trainable": true, "activation": "linear", "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "bias": true, "init": "glorot_uniform", "input_dim": 100}}, {"class_name": "Dense", "config": {"output_dim": 10, "b_constraint": null, "name": "dense_3", "activity_regularizer": null, "trainable": true, "activation": "linear", "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "bias": true, "init": "glorot_uniform", "input_dim": 50}}, {"class_name": "Dense", "config": {"output_dim": 1, "b_constraint": null, "name": "dense_4", "activity_regularizer": null, "trainable": true, "activation": "linear", "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "bias": true, "init": "glorot_uniform", "input_dim": 10}}]}