{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"W_constraint": null, "nb_row": 5, "subsample": [2, 2], "W_regularizer": null, "name": "convolution2d_6", "b_regularizer": null, "border_mode": "valid", "dim_ordering": "tf", "trainable": true, "input_dtype": "float32", "batch_input_shape": [null, 160, 320, 3], "activation": "relu", "bias": true, "nb_filter": 24, "activity_regularizer": null, "nb_col": 5, "b_constraint": null, "init": "glorot_uniform"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "nb_row": 5, "subsample": [2, 2], "W_regularizer": null, "name": "convolution2d_7", "b_regularizer": null, "border_mode": "valid", "dim_ordering": "tf", "trainable": true, "b_constraint": null, "activation": "relu", "bias": true, "nb_filter": 36, "activity_regularizer": null, "nb_col": 5, "init": "glorot_uniform"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "nb_row": 5, "subsample": [2, 2], "W_regularizer": null, "name": "convolution2d_8", "b_regularizer": null, "border_mode": "valid", "dim_ordering": "tf", "trainable": true, "b_constraint": null, "activation": "relu", "bias": true, "nb_filter": 48, "activity_regularizer": null, "nb_col": 5, "init": "glorot_uniform"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "nb_row": 3, "subsample": [1, 1], "W_regularizer": null, "name": "convolution2d_9", "b_regularizer": null, "border_mode": "valid", "dim_ordering": "tf", "trainable": true, "input_dtype": "float32", "batch_input_shape": [null, 160, 320, 3], "activation": "relu", "bias": true, "nb_filter": 64, "activity_regularizer": null, "nb_col": 3, "b_constraint": null, "init": "glorot_uniform"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "nb_row": 3, "subsample": [1, 1], "W_regularizer": null, "name": "convolution2d_10", "b_regularizer": null, "border_mode": "valid", "dim_ordering": "tf", "trainable": true, "input_dtype": "float32", "batch_input_shape": [null, 160, 320, 3], "activation": "relu", "bias": true, "nb_filter": 64, "activity_regularizer": null, "nb_col": 3, "b_constraint": null, "init": "glorot_uniform"}}, {"class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.5}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_regularizer": null, "name": "dense_5", "output_dim": 100, "W_regularizer": null, "trainable": true, "b_constraint": null, "input_dim": 27456, "activation": "linear", "bias": true, "activity_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_regularizer": null, "name": "dense_6", "output_dim": 50, "W_regularizer": null, "trainable": true, "b_constraint": null, "input_dim": 100, "activation": "linear", "bias": true, "activity_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_regularizer": null, "name": "dense_7", "output_dim": 10, "W_regularizer": null, "trainable": true, "b_constraint": null, "input_dim": 50, "activation": "linear", "bias": true, "activity_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_regularizer": null, "name": "dense_8", "output_dim": 1, "W_regularizer": null, "trainable": true, "b_constraint": null, "input_dim": 10, "activation": "linear", "bias": true, "activity_regularizer": null, "init": "glorot_uniform"}}], "keras_version": "1.2.0"}