{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"output_shape": null, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001e<ipython-input-8-bb15d766a4cc>\u00da\b<lambda>\u001a\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "batch_input_shape": [null, 160, 320, 3], "trainable": true, "arguments": {}, "output_shape_type": "raw", "name": "lambda_1", "function_type": "lambda", "input_dtype": "float32"}}, {"class_name": "Cropping2D", "config": {"cropping": [[70, 25], [0, 0]], "name": "cropping2d_1", "trainable": true}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "activation": "relu", "activity_regularizer": null, "W_regularizer": null, "subsample": [2, 2], "b_regularizer": null, "nb_row": 5, "nb_col": 5, "border_mode": "valid", "W_constraint": null, "dim_ordering": "tf", "trainable": true, "init": "glorot_uniform", "nb_filter": 24, "bias": true, "name": "convolution2d_1"}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "activation": "relu", "activity_regularizer": null, "W_regularizer": null, "subsample": [2, 2], "b_regularizer": null, "nb_row": 5, "nb_col": 5, "border_mode": "valid", "W_constraint": null, "dim_ordering": "tf", "trainable": true, "init": "glorot_uniform", "nb_filter": 36, "bias": true, "name": "convolution2d_2"}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "activation": "relu", "activity_regularizer": null, "W_regularizer": null, "subsample": [2, 2], "b_regularizer": null, "nb_row": 5, "nb_col": 5, "border_mode": "valid", "W_constraint": null, "dim_ordering": "tf", "trainable": true, "init": "glorot_uniform", "nb_filter": 48, "bias": true, "name": "convolution2d_3"}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "activation": "relu", "activity_regularizer": null, "W_regularizer": null, "subsample": [1, 1], "b_regularizer": null, "nb_row": 3, "nb_col": 3, "border_mode": "valid", "W_constraint": null, "dim_ordering": "tf", "trainable": true, "init": "glorot_uniform", "nb_filter": 64, "bias": true, "name": "convolution2d_4"}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "activation": "relu", "activity_regularizer": null, "W_regularizer": null, "subsample": [1, 1], "b_regularizer": null, "nb_row": 3, "nb_col": 3, "border_mode": "valid", "W_constraint": null, "dim_ordering": "tf", "trainable": true, "init": "glorot_uniform", "nb_filter": 48, "bias": true, "name": "convolution2d_5"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "activation": "linear", "activity_regularizer": null, "W_regularizer": null, "input_dim": 1584, "output_dim": 100, "b_regularizer": null, "W_constraint": null, "trainable": true, "init": "glorot_uniform", "bias": true, "name": "dense_1"}}, {"class_name": "Dense", "config": {"b_constraint": null, "activation": "linear", "activity_regularizer": null, "W_regularizer": null, "input_dim": 100, "output_dim": 50, "b_regularizer": null, "W_constraint": null, "trainable": true, "init": "glorot_uniform", "bias": true, "name": "dense_2"}}, {"class_name": "Dense", "config": {"b_constraint": null, "activation": "linear", "activity_regularizer": null, "W_regularizer": null, "input_dim": 50, "output_dim": 10, "b_regularizer": null, "W_constraint": null, "trainable": true, "init": "glorot_uniform", "bias": true, "name": "dense_3"}}, {"class_name": "Dense", "config": {"b_constraint": null, "activation": "linear", "activity_regularizer": null, "W_regularizer": null, "input_dim": 10, "output_dim": 1, "b_regularizer": null, "W_constraint": null, "trainable": true, "init": "glorot_uniform", "bias": true, "name": "dense_4"}}], "keras_version": "1.2.0"}