{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"trainable": true, "b_regularizer": null, "bias": true, "activity_regularizer": null, "subsample": [2, 2], "W_constraint": null, "dim_ordering": "tf", "nb_row": 5, "input_dtype": "float32", "init": "glorot_uniform", "W_regularizer": null, "name": "convolution2d_11", "b_constraint": null, "nb_col": 5, "nb_filter": 24, "batch_input_shape": [null, 160, 320, 3], "border_mode": "valid", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "b_regularizer": null, "activity_regularizer": null, "bias": true, "subsample": [2, 2], "W_constraint": null, "dim_ordering": "tf", "nb_row": 5, "init": "glorot_uniform", "W_regularizer": null, "name": "convolution2d_12", "b_constraint": null, "nb_col": 5, "nb_filter": 36, "border_mode": "valid", "activation": "relu"}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_7", "trainable": true}}, {"class_name": "Convolution2D", "config": {"trainable": true, "b_regularizer": null, "activity_regularizer": null, "bias": true, "subsample": [2, 2], "W_constraint": null, "dim_ordering": "tf", "nb_row": 5, "init": "glorot_uniform", "W_regularizer": null, "name": "convolution2d_13", "b_constraint": null, "nb_col": 5, "nb_filter": 48, "border_mode": "valid", "activation": "relu"}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_8", "trainable": true}}, {"class_name": "Convolution2D", "config": {"trainable": true, "b_regularizer": null, "bias": true, "activity_regularizer": null, "subsample": [1, 1], "W_constraint": null, "dim_ordering": "tf", "nb_row": 3, "input_dtype": "float32", "init": "glorot_uniform", "W_regularizer": null, "name": "convolution2d_14", "b_constraint": null, "nb_col": 3, "nb_filter": 64, "batch_input_shape": [null, 160, 320, 3], "border_mode": "valid", "activation": "relu"}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_9", "trainable": true}}, {"class_name": "Convolution2D", "config": {"trainable": true, "b_regularizer": null, "bias": true, "activity_regularizer": null, "subsample": [1, 1], "W_constraint": null, "dim_ordering": "tf", "nb_row": 3, "input_dtype": "float32", "init": "glorot_uniform", "W_regularizer": null, "name": "convolution2d_15", "b_constraint": null, "nb_col": 3, "nb_filter": 64, "batch_input_shape": [null, 160, 320, 3], "border_mode": "valid", "activation": "relu"}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_10", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_3", "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"output_dim": 100, "trainable": true, "b_regularizer": null, "bias": true, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "input_dim": 27456, "init": "glorot_uniform", "W_regularizer": null, "name": "dense_9", "activation": "linear"}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_11", "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 50, "trainable": true, "b_regularizer": null, "bias": true, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "input_dim": 100, "init": "glorot_uniform", "W_regularizer": null, "name": "dense_10", "activation": "linear"}}, {"class_name": "Dense", "config": {"output_dim": 10, "trainable": true, "b_regularizer": null, "bias": true, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "input_dim": 50, "init": "glorot_uniform", "W_regularizer": null, "name": "dense_11", "activation": "linear"}}, {"class_name": "Dense", "config": {"output_dim": 1, "trainable": true, "b_regularizer": null, "bias": true, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "input_dim": 10, "init": "glorot_uniform", "W_regularizer": null, "name": "dense_12", "activation": "linear"}}]}