{"keras_version": "1.2.0", "config": [{"config": {"input_dtype": "float32", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001e<ipython-input-2-bb15d766a4cc>\u00da\b<lambda>\u001a\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "batch_input_shape": [null, 160, 320, 3], "output_shape": null, "trainable": true, "name": "lambda_1", "function_type": "lambda", "arguments": {}, "output_shape_type": "raw"}, "class_name": "Lambda"}, {"config": {"name": "cropping2d_1", "cropping": [[70, 25], [0, 0]], "trainable": true}, "class_name": "Cropping2D"}, {"config": {"subsample": [2, 2], "init": "glorot_uniform", "trainable": true, "nb_row": 5, "bias": true, "border_mode": "valid", "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "dim_ordering": "tf", "nb_col": 5, "name": "convolution2d_1", "b_regularizer": null, "W_constraint": null, "activation": "relu", "nb_filter": 24}, "class_name": "Convolution2D"}, {"config": {"subsample": [2, 2], "init": "glorot_uniform", "trainable": true, "nb_row": 5, "bias": true, "border_mode": "valid", "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "dim_ordering": "tf", "nb_col": 5, "name": "convolution2d_2", "b_regularizer": null, "W_constraint": null, "activation": "relu", "nb_filter": 36}, "class_name": "Convolution2D"}, {"config": {"subsample": [2, 2], "init": "glorot_uniform", "trainable": true, "nb_row": 5, "bias": true, "border_mode": "valid", "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "dim_ordering": "tf", "nb_col": 5, "name": "convolution2d_3", "b_regularizer": null, "W_constraint": null, "activation": "relu", "nb_filter": 48}, "class_name": "Convolution2D"}, {"config": {"subsample": [1, 1], "init": "glorot_uniform", "trainable": true, "nb_row": 3, "bias": true, "border_mode": "valid", "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "dim_ordering": "tf", "nb_col": 3, "name": "convolution2d_4", "b_regularizer": null, "W_constraint": null, "activation": "relu", "nb_filter": 64}, "class_name": "Convolution2D"}, {"config": {"subsample": [1, 1], "init": "glorot_uniform", "trainable": true, "nb_row": 3, "bias": true, "border_mode": "valid", "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "dim_ordering": "tf", "nb_col": 3, "name": "convolution2d_5", "b_regularizer": null, "W_constraint": null, "activation": "relu", "nb_filter": 48}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "init": "glorot_uniform", "trainable": true, "bias": true, "W_regularizer": null, "b_constraint": null, "output_dim": 100, "activity_regularizer": null, "input_dim": 1584, "b_regularizer": null, "activation": "linear", "W_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dense_2", "init": "glorot_uniform", "trainable": true, "bias": true, "W_regularizer": null, "b_constraint": null, "output_dim": 50, "activity_regularizer": null, "input_dim": 100, "b_regularizer": null, "activation": "linear", "W_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dense_3", "init": "glorot_uniform", "trainable": true, "bias": true, "W_regularizer": null, "b_constraint": null, "output_dim": 10, "activity_regularizer": null, "input_dim": 50, "b_regularizer": null, "activation": "linear", "W_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dense_4", "init": "glorot_uniform", "trainable": true, "bias": true, "W_regularizer": null, "b_constraint": null, "output_dim": 1, "activity_regularizer": null, "input_dim": 10, "b_regularizer": null, "activation": "linear", "W_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential"}