{"class_name": "Sequential", "config": [{"class_name": "BatchNormalization", "config": {"batch_input_shape": [null, 160, 320, 3], "input_dtype": "float32", "epsilon": 0.001, "name": "batchnormalization_1", "momentum": 0.99, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "mode": 0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "W_constraint": null, "nb_row": 5, "trainable": true, "b_regularizer": null, "dim_ordering": "tf", "subsample": [2, 2], "activation": "relu", "bias": true, "activity_regularizer": null, "nb_filter": 24, "init": "glorot_uniform", "W_regularizer": null, "name": "convolution2d_1", "border_mode": "valid", "b_constraint": null}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "W_constraint": null, "nb_row": 5, "trainable": true, "b_regularizer": null, "dim_ordering": "tf", "subsample": [2, 2], "activation": "relu", "bias": true, "activity_regularizer": null, "nb_filter": 36, "init": "glorot_uniform", "W_regularizer": null, "name": "convolution2d_2", "border_mode": "valid", "b_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_1"}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "W_constraint": null, "nb_row": 5, "trainable": true, "b_regularizer": null, "dim_ordering": "tf", "subsample": [2, 2], "activation": "relu", "bias": true, "activity_regularizer": null, "nb_filter": 48, "init": "glorot_uniform", "W_regularizer": null, "name": "convolution2d_3", "border_mode": "valid", "b_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_2"}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "W_constraint": null, "batch_input_shape": [null, 160, 320, 3], "input_dtype": "float32", "b_regularizer": null, "dim_ordering": "tf", "subsample": [1, 1], "nb_row": 3, "trainable": true, "bias": true, "activation": "relu", "nb_filter": 64, "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "name": "convolution2d_4", "border_mode": "valid", "b_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_3"}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "W_constraint": null, "batch_input_shape": [null, 160, 320, 3], "input_dtype": "float32", "b_regularizer": null, "dim_ordering": "tf", "subsample": [1, 1], "nb_row": 3, "trainable": true, "bias": true, "activation": "relu", "nb_filter": 64, "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "name": "convolution2d_5", "border_mode": "valid", "b_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_4"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_regularizer": null, "input_dim": 27456, "output_dim": 100, "activation": "linear", "bias": true, "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "b_constraint": null, "trainable": true, "name": "dense_1"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_regularizer": null, "input_dim": 100, "output_dim": 50, "activation": "linear", "bias": true, "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "b_constraint": null, "trainable": true, "name": "dense_2"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_regularizer": null, "input_dim": 50, "output_dim": 10, "activation": "linear", "bias": true, "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "b_constraint": null, "trainable": true, "name": "dense_3"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_regularizer": null, "input_dim": 10, "output_dim": 1, "activation": "linear", "bias": true, "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "b_constraint": null, "trainable": true, "name": "dense_4"}}], "keras_version": "1.2.0"}