{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"batch_input_shape": [null, 160, 320, 3], "input_dtype": "float32", "output_shape": null, "function_type": "lambda", "output_shape_type": "raw", "arguments": {}, "name": "lambda_1", "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001e<ipython-input-8-49f8ea0fbedc>\u00da\b<lambda>\"\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null]}}, {"class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 1, "b_constraint": null, "name": "dense_5", "activity_regularizer": null, "trainable": true, "activation": "linear", "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "bias": true, "init": "glorot_uniform", "input_dim": 153600}}]}